"I have read and agree to the WPS Office License Agreement and the Privacy Policy." = "I have read and agree to the WPS Office License Agreement and the Privacy Policy.";

"WPS Office License Agreement" = "WPS Office License Agreement";

"Privacy Policy" = "Privacy Policy";

"Download failed, please check the network" = "Download failed, please check the network";

"manual install" = "manual install";

"Retry" = "Retry";

"Install Now" = "Install Now";

"Installation failed, please check if the system has enough memory space." = "Installation failed, please check if the system has enough memory space.";

"Installation failed, please close the running WPS Office." = "Installation failed, please close the running WPS Office.";

"Installing, please wait..." = "Downloading, please wait...";

"Language" = "Language";

"All-in-One OfficeSuite with PDFEditor. Now with AI" = "AI-Powered Office & PDF Suite for Everyone";

"Cancel" = "Cancel";

"Tip" = "Tip";

"Confirm" = "Confirm";

"In accordance with relevant policy requirements, for a better experience with WPS Office services, please read and agree to License Agreement and Privacy Policy." = "In accordance with relevant policy requirements, for a better experience with WPS Office services, please read and agree to the License Agreement and Privacy Policy.";

"License Agreement" = "License Agreement";

"Create infinite possibilities" = "Create infinite possibilities";

"Installing WPS Office" = "Installing WPS Office...";

"Before installing, please close the running WPS Office." = "Before installing, please close the running WPS Office.";